using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//Task 2.1: Спроектировать объектную модель для заданной предметной области
//Новогодний подарок:
//Новогодний подарок.Определить иерархию конфет и прочих сладостей.
//Создать несколько объектов-конфет.Собрать детский подарок с определением его веса.
//Провести сортировку конфет в подарке на основе одного из параметров.
//Найти конфету в подарке, соответствующую заданному диапазону параметров.

namespace Task2_1
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
